fonecmid-diplom/src/Documents/ВКМ_ВыплатаЗарплаты/ВКМ_ВыплатаЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ВыплатаЗарплаты</name>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Выплаты</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ВКМ_Числовой</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВКМ_ВыплатаЗарплаты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
//++Симбирёва О.С 02.07.26
	
	Сотрудники = Новый Массив;
	
	Для Каждого Строка Из Выплаты Цикл
		Если Сотрудники.Найти(Строка.Сотрудник) = Неопределено Тогда
			Сотрудники.Добавить(Строка.Сотрудник);
		КонецЕсли;
	КонецЦикла;

	СформироватьДвижения();
	
	РассчитатьВыплаты(Сотрудники);
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	
//--Симбирёва О.С 02.07.26
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвижения()
	
//++Симбирёва О.С 02.07.26
	
	Если Выплаты.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Заполните табличную часть");
		Возврат;
	КонецЕсли;
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Очистить();
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	Для Каждого Строка Из Выплаты Цикл
		
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		
	КонецЦикла;
	
//--Симбирёва О.С 02.07.26
		
КонецПроцедуры

Процедура РассчитатьВыплаты(Сотрудники)
	
//++Симбирёва О.С 02.07.26
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Дата, Сотрудник В (&СписокСотрудников)) КАК
	|		ВКМ_ВзаиморасчетыССотрудникамиОстатки";
	
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("СписокСотрудников", Сотрудники);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Остатки = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		Остатки.Вставить(Выборка.Сотрудник, Выборка.СуммаОстаток);
	КонецЦикла;
	
	Для Каждого Строка Из Выплаты Цикл
		
		Остаток = Остатки.Получить(Строка.Сотрудник);
		
		Если Остаток = Неопределено Тогда
			Остаток = 0;
		КонецЕсли;
		
		Если Строка.Сумма > Остаток Тогда
			
			ШаблонСообщения = "У сотрудника %1 недостаточно средств для выплаты. Доступно: %2 руб., запрошено: %3 руб.";
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ШаблонСообщения, Строка.Сотрудник, Остаток, Строка.Сумма));
			Возврат;
			
		КонецЕсли;
		
		Если Остаток = 0 Тогда
			
			ШаблонСообщения = "У сотрудника %1 нет суммы к выплате на дату %2";
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ШаблонСообщения, Строка.Сотрудник, Формат(Дата, "ДФ=dd.MM.yyyy")));
			Возврат;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Индекс = 0;
	Для Каждого Движение Из Движения.ВКМ_ВзаиморасчетыССотрудниками Цикл
		Движение.Сумма = Выплаты[Индекс].Сумма;
		Индекс = Индекс + 1;
	КонецЦикла;
	
//--Симбирёва О.С 02.07.26

КонецПроцедуры

#КонецОбласти

#КонецЕсли
